
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription
* Replace
  * module.pre_api[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/500e642d-76ef-4d82-8741-bf9e9d979705"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/37f73c17-345b-4c67-81d5-50d582e97227"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/da1d82f9-7187-4cb6-a6dd-b0020311f3bb"
        # (10 unchanged attributes hidden)
    }

  # module.pre_api[0].azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api;rev=66" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "pre-api"
      ~ revision              = "66" -> "67" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (12 unchanged attributes hidden)

      ~ subscription_key_parameter_names {
          + api_management_name   = (known after apply)
          + api_type              = (known after apply)
          + description           = (known after apply)
          + display_name          = (known after apply)
          + id                    = (known after apply)
          + is_current            = (known after apply)
          + is_online             = (known after apply)
          + name                  = (known after apply)
          + path                  = (known after apply)
          + protocols             = (known after apply)
          + resource_group_name   = (known after apply)
          + revision              = (known after apply)
          + revision_description  = (known after apply)
          + service_url           = (known after apply)
          + soap_pass_through     = (known after apply)
          + source_api_id         = (known after apply)
          + subscription_required = (known after apply)
          + terms_of_service_url  = (known after apply)
          + version               = (known after apply)
          + version_description   = (known after apply)
          + version_set_id        = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":551,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->